In [4]:
import sqlite3
import pandas as pd

In [12]:
conn = sqlite3.connect('/home/tatiane/dataengineer/spark-study/spark-study.db')

In [6]:
tabelas = pd.read_sql_query('SELECT NAME as Table_Name FROM sqlite_master WHERE type = "table"', conn)

In [8]:
'''
for tabela in list(tabelas['Table_Name']):
    resultado = pd.read_sql_query('PRAGMA TABLE_INFO({})'.format(tabela), conn)
    print('Table ', tabela)
    display(resultado)
    print('\n')
'''

Table  contacts

   cid        name     type  notnull dflt_value  pk
0    0  contact_id  INTEGER        0       None   1
1    1  First_name     TEXT        1       None   0
2    2   Last_name     TEXT        1       None   0
3    3       email     TEXT        1       None   0
4    4       phone     TEXT        1       None   0

In [9]:
tabela = pd.read_sql_query('SELECT * FROM contacts', conn)

   contact_id First_name Last_name              email        phone
0           0      Julia   Alencar  julia@alencar.com  21987294455
1           1       Alex     Rocha     alex@rocha.com  21987763455
2           2      Jessy    Correa   jessy@correa.com  21981733455

In [10]:
tabela.to_csv('/home/tatiane/dataengineer/spark-study/tabela_spark-study.csv')